## Plan Result (Managed_Identity)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.acme-vault-access[1]
  * azurerm_user_assigned_identity.wi-admin-mi




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.acme-vault-access has moved to azurerm_role_assignment.acme-vault-access[0]
    resource "azurerm_role_assignment" "acme-vault-access" {
        id                   = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox/providers/Microsoft.Authorization/roleAssignments/e29054b9-f5f7-7d8e-b193-605bf45ae380"
        name                 = "e29054b9-f5f7-7d8e-b193-605bf45ae380"
        # (5 unchanged attributes hidden)
    }

  # azurerm_role_assignment.acme-vault-access[1] will be created
  + resource "azurerm_role_assignment" "acme-vault-access" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (known after apply)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/b72ab7b7-723f-4b18-b6f6-03b0f2c6a1bb/resourceGroups/cft-platform-sbox-rg/providers/Microsoft.KeyVault/vaults/acmedcdcftappssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.wi-admin-mi will be created
  + resource "azurerm_user_assigned_identity" "wi-admin-mi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "admin-sandbox-mi"
      + principal_id        = (known after apply)
      + resource_group_name = "managed-identities-sbox-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/aks-cft-deploy"
          + "businessArea" = "CFT"
          + "criticality"  = "Low"
          + "environment"  = "sandbox"
          + "expiresAfter" = "3000-01-01"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":539,"Program":"tfcmt","SHA1":"","Target":"Managed_Identity","Vars":{}} -->